"1 127 1 4206624772 ,"
"input0 4 1 3 400 400 0 ,"
" 301 303 304 306 307 309 310 312 313 315 316 318 319 321 322 324 325 327 328 330 331 333 334 336 337 339 340 342 343 345 346 348 349 351 352 354 355 357 358 360 361 363 364 366 367 369 370 372 373 375 376 378 379 381 382 384 385 387 388 390 407 408 409 411 428 429 430 432 433 435 437 438 440 442 443 445 446 447 449 451 452 454 456 457 459 460 461 463 465 466 468 470 471 473 474 475 476 486 487 488 498 499 500 510 512 513 523 524 525 535 536 537 547 548 549 550 560 561 562 572 573 574 584 585 586 input0 output0 ,"
"585 586 output0 ,"
" 126 ,"
"Convolution 301 1 1 input0 301 1 3 8 3 3 2 2 1 1 1 -1 1 1 0 ,"
"PReLU 303 1 1 301 303 1 0 ,"
"Convolution 304 1 1 303 304 8 1 8 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU 306 1 1 304 306 1 0 ,"
"Convolution 307 1 1 306 307 1 8 16 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU 309 1 1 307 309 1 0 ,"
"Convolution 310 1 1 309 310 16 1 16 3 3 2 2 1 1 1 -1 1 1 0 ,"
"PReLU 312 1 1 310 312 1 0 ,"
"Convolution 313 1 1 312 313 1 16 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU 315 1 1 313 315 1 0 ,"
"Convolution 316 1 1 315 316 32 1 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU 318 1 1 316 318 1 0 ,"
"Convolution 319 1 1 318 319 1 32 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU 321 1 1 319 321 1 0 ,"
"Convolution 322 1 1 321 322 32 1 32 3 3 2 2 1 1 1 -1 1 1 0 ,"
"PReLU 324 1 1 322 324 1 0 ,"
"Convolution 325 1 1 324 325 1 32 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU 327 1 1 325 327 1 0 ,"
"Convolution 328 1 1 327 328 64 1 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU 330 1 1 328 330 1 0 ,"
"Convolution 331 1 1 330 331 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU 333 1 1 331 333 1 0 ,"
"Convolution 334 1 1 333 334 64 1 64 3 3 2 2 1 1 1 -1 1 1 0 ,"
"PReLU 336 1 1 334 336 1 0 ,"
"Convolution 337 1 1 336 337 1 64 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU 339 1 1 337 339 1 0 ,"
"Convolution 340 1 1 339 340 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU 342 1 1 340 342 1 0 ,"
"Convolution 343 1 1 342 343 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU 345 1 1 343 345 1 0 ,"
"Convolution 346 1 1 345 346 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU 348 1 1 346 348 1 0 ,"
"Convolution 349 1 1 348 349 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU 351 1 1 349 351 1 0 ,"
"Convolution 352 1 1 351 352 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU 354 1 1 352 354 1 0 ,"
"Convolution 355 1 1 354 355 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU 357 1 1 355 357 1 0 ,"
"Convolution 358 1 1 357 358 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU 360 1 1 358 360 1 0 ,"
"Convolution 361 1 1 360 361 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU 363 1 1 361 363 1 0 ,"
"Convolution 364 1 1 363 364 128 1 128 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU 366 1 1 364 366 1 0 ,"
"Convolution 367 1 1 366 367 1 128 128 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU 369 1 1 367 369 1 0 ,"
"Convolution 370 1 1 369 370 128 1 128 3 3 2 2 1 1 1 -1 1 1 0 ,"
"PReLU 372 1 1 370 372 1 0 ,"
"Convolution 373 1 1 372 373 1 128 256 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU 375 1 1 373 375 1 0 ,"
"Convolution 376 1 1 375 376 256 1 256 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU 378 1 1 376 378 1 0 ,"
"Convolution 379 1 1 378 379 1 256 256 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU 381 1 1 379 381 1 0 ,"
"Convolution 382 1 1 333 382 1 64 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU 384 1 1 382 384 1 0 ,"
"Convolution 385 1 1 369 385 1 128 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU 387 1 1 385 387 1 0 ,"
"Convolution 388 1 1 381 388 1 256 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU 390 1 1 388 390 1 0 ,"
"Upsample 407 1 1 390 407 1 1.92308 1.92308 0 ,"
"Add 408 2 1 387 407 408 -1 ,"
"Convolution 409 1 1 408 409 1 64 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU 411 1 1 409 411 1 0 ,"
"Upsample 428 1 1 411 428 1 2 2 0 ,"
"Add 429 2 1 384 428 429 -1 ,"
"Convolution 430 1 1 429 430 1 64 64 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU 432 1 1 430 432 1 0 ,"
"Convolution 433 1 1 432 433 1 64 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution 435 1 1 432 435 1 64 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU 437 1 1 435 437 1 0 ,"
"Convolution 438 1 1 437 438 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution 440 1 1 437 440 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU 442 1 1 440 442 1 0 ,"
"Convolution 443 1 1 442 443 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Concat 445 3 1 433 438 443 445 1 ,"
"ReLU 446 1 1 445 446 ,"
"Convolution 447 1 1 411 447 1 64 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution 449 1 1 411 449 1 64 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU 451 1 1 449 451 1 0 ,"
"Convolution 452 1 1 451 452 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution 454 1 1 451 454 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU 456 1 1 454 456 1 0 ,"
"Convolution 457 1 1 456 457 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Concat 459 3 1 447 452 457 459 1 ,"
"ReLU 460 1 1 459 460 ,"
"Convolution 461 1 1 390 461 1 64 32 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution 463 1 1 390 463 1 64 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU 465 1 1 463 465 1 0 ,"
"Convolution 466 1 1 465 466 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Convolution 468 1 1 465 468 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU 470 1 1 468 470 1 0 ,"
"Convolution 471 1 1 470 471 1 16 16 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Concat 473 3 1 461 466 471 473 1 ,"
"ReLU 474 1 1 473 474 ,"
"Convolution 475 1 1 446 475 1 64 8 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute 476 1 1 475 476 4 0 2 3 1 ,"
"Reshape 486 1 1 476 486 0 3 3 0 -1 4 0 ,"
"Convolution 487 1 1 460 487 1 64 8 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute 488 1 1 487 488 4 0 2 3 1 ,"
"Reshape 498 1 1 488 498 0 3 3 0 -1 4 0 ,"
"Convolution 499 1 1 474 499 1 64 8 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute 500 1 1 499 500 4 0 2 3 1 ,"
"Reshape 510 1 1 500 510 0 3 3 0 -1 4 0 ,"
"Concat output0 3 1 486 498 510 output0 1 ,"
"Convolution 512 1 1 446 512 1 64 4 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute 513 1 1 512 513 4 0 2 3 1 ,"
"Reshape 523 1 1 513 523 0 3 3 0 -1 2 0 ,"
"Convolution 524 1 1 460 524 1 64 4 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute 525 1 1 524 525 4 0 2 3 1 ,"
"Reshape 535 1 1 525 535 0 3 3 0 -1 2 0 ,"
"Convolution 536 1 1 474 536 1 64 4 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute 537 1 1 536 537 4 0 2 3 1 ,"
"Reshape 547 1 1 537 547 0 3 3 0 -1 2 0 ,"
"Concat 548 3 1 523 535 547 548 1 ,"
"Convolution 549 1 1 446 549 1 64 20 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute 550 1 1 549 550 4 0 2 3 1 ,"
"Reshape 560 1 1 550 560 0 3 3 0 -1 10 0 ,"
"Convolution 561 1 1 460 561 1 64 20 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute 562 1 1 561 562 4 0 2 3 1 ,"
"Reshape 572 1 1 562 572 0 3 3 0 -1 10 0 ,"
"Convolution 573 1 1 474 573 1 64 20 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Permute 574 1 1 573 574 4 0 2 3 1 ,"
"Reshape 584 1 1 574 584 0 3 3 0 -1 10 0 ,"
"Concat 585 3 1 560 572 584 585 1 ,"
"SoftmaxCaffe 586 1 1 548 586 2 ,"
